In [1]:
import pandas as pd

In [4]:
!type example1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [6]:
df = pd.read_csv('example1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [7]:
# same thing just using read_table

df2 = pd.read_table('example1.csv', sep=',')
df2

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [10]:
# You can tell the function how to handle headers

df3 = pd.read_csv('example1.csv', names=['first', 'second', 'third', 'fourth', 'fifth'])

df3

  first second third fourth    fifth
0     a      b     c      d  message
1     1      2     3      4    hello
2     5      6     7      8    world
3     9     10    11     12      foo

In [14]:
# You can specify that a list (or something from the file itself), be the index

df4 = pd.read_csv('example1.csv', index_col='c')

df4

    a   b   d message
c
3   1   2   4   hello
7   5   6   8   world
11  9  10  12     foo

In [16]:
# You can specify keys to be multi-level indices

df5 = pd.read_csv('example2.csv', index_col=['First Key', 'Second Key'])

df5

                     Col 1 Col 2 Col 3 Col 4    Col 5
First Key Second Key
first     a              a     b     c     d  message
          b              1     2     3     4    hello
          c              5     6     7     8    world
          d              9    10    11    12      foo
second    a              a     b     c     d  message
          b              1     2     3     4    hello
          c              5     6     7     8    world
          d              9    10    11    12      foo

In [20]:
# Can easily specify rows to skip
!type example3.csv

#Junk row again,,,,,,
# Junk row,,,,,,
First Key,Second Key,Col 1,Col 2,Col 3,Col 4,Col 5
first,a,a,b,c,d,message
first,b,1,2,3,4,hello
first,c,5,6,7,8,world
first,d,9,10,11,12,foo
second,a,a,b,c,d,message
second,b,1,2,3,4,hello
second,c,5,6,7,8,world
second,d,9,10,11,12,foo

In [ ]:
df6 = pd.read_csv('example3.csv', skiprows=[0, 1])

df6

In [22]:
# Null value handling
!type example4.csv

#Junk row again,,,,,,
# Junk row,,,,,,
First Key,Second Key,Col 1,Col 2,Col 3,Col 4,Col 5
first,a,a,b,c,d,message
first,Nullz,1,NAAN,3,4,hello
first,c,5,6,Nullz,8,world
first,d,9,10,11,12,foo
second,a,a,b,c,d,message
second,b,1,Nullz,3,4,hello
second,c,NAAN,6,7,8,world
second,d,9,10,11,12,foo

In [25]:
df7 = pd.read_csv('example4.csv', skiprows=[0, 1], na_values=['Nullz', 'NAAN'])
df7
df7.isnull()

   First Key  Second Key  Col 1  Col 2  Col 3  Col 4  Col 5
0      False       False  False  False  False  False  False
1      False        True  False   True  False  False  False
2      False       False  False  False   True  False  False
3      False       False  False  False  False  False  False
4      False       False  False  False  False  False  False
5      False       False  False   True  False  False  False
6      False       False   True  False  False  False  False
7      False       False  False  False  False  False  False

In [29]:
# Iterating and chunking through files
pd.options.display.max_rows = 10
df8 = pd.read_csv('example5.csv', skiprows=[0, 1], na_values=['Nullz', 'NAAN'])

df8

    First Key Second Key Col 1 Col 2 Col 3 Col 4    Col 5
0       first          a     a     b     c     d  message
1       first        NaN     1   NaN     3     4    hello
2       first          c     5     6   NaN     8    world
3       first          d     9    10    11    12      foo
4      second          a     a     b     c     d  message
..        ...        ...   ...   ...   ...   ...      ...
195     first          d     9    10    11    12      foo
196    second          a     a     b     c     d  message
197    second          b     1   NaN     3     4    hello
198    second          c   NaN     6     7     8    world
199    second          d     9    10    11    12      foo

[200 rows x 7 columns]

In [31]:
# Control over specific rows

df9 = pd.read_csv('example5.csv', skiprows=[0, 1], na_values=['Nullz', 'NAAN'], nrows=5)

df9

  First Key Second Key Col 1 Col 2 Col 3 Col 4    Col 5
0     first          a     a     b     c     d  message
1     first        NaN     1   NaN     3     4    hello
2     first          c     5     6   NaN     8    world
3     first          d     9    10    11    12      foo
4    second          a     a     b     c     d  message

In [50]:
# Make a chunk object for working through data

chunk_obj = pd.read_csv('example5.csv', skiprows=[0, 1], na_values=['Nullz', 'NAAN'], chunksize=20)
chunk_obj

In [51]:
df10 = pd.DataFrame()
for piece in chunk_obj:
    df10 = df10.append(piece)
    
df10

    First Key Second Key Col 1 Col 2 Col 3 Col 4    Col 5
0       first          a     a     b     c     d  message
1       first        NaN     1   NaN     3     4    hello
2       first          c     5     6   NaN     8    world
3       first          d     9    10    11    12      foo
4      second          a     a     b     c     d  message
..        ...        ...   ...   ...   ...   ...      ...
195     first          d     9    10    11    12      foo
196    second          a     a     b     c     d  message
197    second          b     1   NaN     3     4    hello
198    second          c   NaN     6     7     8    world
199    second          d     9    10    11    12      foo

[200 rows x 7 columns]

In [52]:
# And you can write to storage formats
df10.to_csv('out1.csv')

In [ ]:
!type out1.csv

In [56]:
# You can change delim and what not
import sys
# using this to write to console

df3.to_csv(sys.stdout, sep='|')

|first|second|third|fourth|fifth
0|a|b|c|d|message
1|1|2|3|4|hello
2|5|6|7|8|world
3|9|10|11|12|foo

In [57]:
# You can do things like strip headers, index, specify NA values
df9.to_csv(sys.stdout, sep='|', header=False, index=False, na_rep='NULL')

first|a|a|b|c|d|message
first|NULL|1|NULL|3|4|hello
first|c|5|6|NULL|8|world
first|d|9|10|11|12|foo
second|a|a|b|c|d|message

In [59]:
# Quickly on delim formats
import csv
!type example6.csv

'a','b','c'
'1','2','3'
'5','6','7'
'9','10','11'

In [72]:
f = open('example6.csv')
reader = csv.reader(f)

for line in reader:
    print(line)

["'a'", "'b'", "'c'"]
["'1'", "'2'", "'3'"]
["'5'", "'6'", "'7'"]
["'9'", "'10'", "'11'"]

In [63]:
with open('example6.csv') as f:
    lines = list(csv.reader(f))

In [67]:
header, values = lines[0], lines[1:]
# header
values

[["'1'", "'2'", "'3'"], ["'5'", "'6'", "'7'"], ["'9'", "'10'", "'11'"]]

In [69]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

data_dict
# Now you can get it into pandas

{"'a'": ("'1'", "'5'", "'9'"),
 "'b'": ("'2'", "'6'", "'10'"),
 "'c'": ("'3'", "'7'", "'11'")}

In [73]:
# And if you were doing a lot of this, you could create a dialect class

class my_dialect(csv.Dialect):
    lineterminator = "\n"
    delimiter = ";"
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL
    
reader = csv.reader(f, dialect=my_dialect)

In [74]:
f.close()

In [85]:
# JSON

json_obj = """
{"name": "Jord",
"hobbies": ["Games", "Exercise", "Catch"],
"family": [{"name": "Craig", "pets": ["Worf", "Ricky"]},
            {"name": "Meaghan"}]
    }
"""

In [84]:
json_obj

'\n{"name": "Jord",\n"hobbies": ["Games", "Exercise", "Catch"],\n"family": [{"name": "Craig", "pets": ["Worf", "Ricky"]},\n            {"name": "Meaghan"}]\n}\n'

In [86]:
import json

result = json.loads(json_obj)

result

{'family': [{'name': 'Craig', 'pets': ['Worf', 'Ricky']}, {'name': 'Meaghan'}],
 'hobbies': ['Games', 'Exercise', 'Catch'],
 'name': 'Jord'}

In [88]:
# And it's easy enough to get these into a df

df11 = pd.DataFrame(result['family'], columns=['name'])
df11

      name
0    Craig
1  Meaghan

In [90]:
# Back to json

df11.to_json()

'{"name":{"0":"Craig","1":"Meaghan"}}'

In [11]:
from lxml import objectify

In [9]:
tables = pd.read_html('fdic_failed_bank_ex.html')
# So easy, awesome

In [7]:
type(tables)
len(tables)

1

In [10]:
failures = tables[0]
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [13]:
# Using lxml to parse xml data

xml_doc = 'Performance_MNR.xml'
parsed_file = objectify.parse(open(xml_doc))
root = parsed_file.getroot()

In [14]:
root.INDICATOR

In [15]:
data = []

skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ', 'DESIRED_CHANGE', 'DECIMAL_PLACES']

for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [16]:
performance_df = pd.DataFrame(data)
performance_df.head()

,AGENCY_NAME,CATEGORY,DESCRIPTION,FREQUENCY,INDICATOR_NAME,INDICATOR_UNIT,MONTHLY_ACTUAL,MONTHLY_TARGET,PERIOD_MONTH,PERIOD_YEAR,YTD_ACTUAL,YTD_TARGET
0,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,96.9,95,1,2008,96.9,95
1,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,95,95,2,2008,96,95
2,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,96.9,95,3,2008,96.3,95
3,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,98.3,95,4,2008,96.8,95
4,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,95.8,95,5,2008,96.6,95

In [18]:
# HTML link tags are also valid XML
from io import StringIO

tag = '<a href="https://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [25]:
root
type(root.attrib)
root.attrib
root.get('href')
root.items()
root.text

'Google'